export const questions = [
  {
    id: 1,
    question: "توجد الألكانات في:",
    options: ["البترول والوقود الحفري", "البترول والغاز الطبيعي", "الغاز الطبيعي والوقود الحفري", "الفحم والبترول"],
    correctAnswer: 1
  },
  {
    id: 2,
    question: "المركب الذي يعرف بغاز المستنقعات هو:",
    options: ["الإيثان", "الميثان", "البروبان", "البيوتان"],
    correctAnswer: 1
  },
  {
    id: 3,
    question: "الصيغة الجزيئية للمركبات المشبعة هي:",
    options: ["CnH2n+1", "CnH2n+2", "CnH2n", "CnH2n-2"],
    correctAnswer: 1
  },
  {
    id: 4,
    question: "مجموعة الألكيل هي:",
    options: ["ألكاين أزيلت منه ذرة هيدروجين", "ألكان أزيلت منه ذرتين هيدروجين", "ألكان أضيفت له ذرة هيدروجين", "ألكان أزيلت منه ذرة هيدروجين"],
    correctAnswer: 3
  },
  {
    id: 5,
    question: "يشكل الميثان من الغاز الطبيعي حوالي:",
    options: ["50%", "60%", "70%", "80%"],
    correctAnswer: 3
  },
  {
    id: 6,
    question: "المزيج المعقد من مواد عضوية مختلفة هو:",
    options: ["الفحم", "الغاز الطبيعي", "البترول", "الوقود الحفري"],
    correctAnswer: 2
  },
  {
    id: 7,
    question: "الغاز الطبيعي يتكون من:",
    options: ["الميثان، البروبان، الإيثان، البيوتان", "البيوتان، البروبان، الإيثان، الهكسان", "الإيثين، البروبين، البيوتين، الهكسين", "الميثان فقط"],
    correctAnswer: 0
  },
  {
    id: 8,
    question: "ألكان به 5 ذرات كربون كم تكون عدد ذرات الهيدروجين فيه:",
    options: ["10 ذرات هيدروجين", "8 ذرات هيدروجين", "12 ذرة هيدروجين", "14 ذرة هيدروجين"],
    correctAnswer: 2
  },
  {
    id: 9,
    question: "الصيغة الجزيئية للألكينات الحلقية:",
    options: ["CnH2n+2", "CnH2n-1", "CnH2n-2", "CnH2n"],
    correctAnswer: 3
  },
  {
    id: 10,
    question: "المركب CH3 CH(CH3) CH=CH CH3 اسمه النظامي:",
    options: ["4-methyl 3-pentene", "4-methyl 2-pentene", "2-methyl 4-pentene", "2-methyl 3-pentene"],
    correctAnswer: 1
  },
  {
    id: 11,
    question: "يستعمل غاز الاستلين في أعمال اللحام لأن درجة حرارته تساوي:",
    options: ["3000 درجة مئوية", "300 درجة مئوية", "30000 درجة مئوية", "250 درجة مئوية"],
    correctAnswer: 0
  },
  {
    id: 12,
    question: "في الكحول الأولي ترتبط:",
    options: ["ذرة الكربون التي تحمل مجموعة OH بذرة هيدروجين ومجموعة ألكيل.", "ذرة الكربون التي تحمل مجموعة OH بذرتي هيدروجين ومجموعة ألكيل واحدة.", "ذرة الكربون التي تحمل مجموعة OH ولا تحتوي على ذرة هيدروجين ولكن تحتوي على ثلاثة مجموعة ألكيل.", "ذرة الكربون التي تحمل مجموعة OH."],
    correctAnswer: 1
  },
  {
    id: 13,
    question: "في الكحول الثانوي:",
    options: ["ترتبط ذرة الكربون التي تحمل مجموعة OH بذرة هيدروجين ومجموعتي ألكيل.", "ترتبط ذرة الكربون التي تحمل مجموعة OH بذرتي هيدروجين ومجموعة ألكيل.", "ذرة الكربون التي تحمل مجموعة OH ولا تحتوي على ذرة هيدروجين.", "ذرة الكربون التي تحمل مجموعة OH فقط."],
    correctAnswer: 0
  },
  {
    id: 14,
    question: "الصيغة الجزيئية C6H12O تمثل:",
    options: ["إيثر وكحول", "ألدهيد وكيتون", "إستر وحمض كربوكسلي", "ألكان وألكين"],
    correctAnswer: 1
  },
  {
    id: 15,
    question: "أي العبارات صحيحة عن الشكل Trans ترانس؟",
    options: ["المجموعتين المتشابهتين على نفس جهة الرابطة الثنائية", "المجموعتين المتشابهتين على جهتين متعاكستين من الرابطة الثنائية", "يرمز له بالرمز Z", "يحدث في الألكانات المشبعة"],
    correctAnswer: 1
  },
  {
    id: 16,
    question: "أي العبارات صحيحة عن الشكل Cis؟",
    options: ["المجموعتين المتشابهتين على نفس جهة الرابطة الثنائية", "المجموعتين المتشابهتين على جهتين متعاكستين من الرابطة الثنائية", "تحدث في كل الألكانات", "لا تحتاج رابطة ثنائية"],
    correctAnswer: 0
  },
  {
    id: 17,
    question: "أول مادة عضوية تم تصنيعها معملياً من مادة غير عضوية هي:",
    options: ["الإيثانول", "اليوريا", "الميثان", "الجلوكوز"],
    correctAnswer: 1
  },
  {
    id: 18,
    question: "مركب ألكان يحتوي على 12 ذرة هيدروجين. كم عدد ذرات الكربون فيه؟",
    options: ["4", "5", "6", "12"],
    correctAnswer: 1
  },
  {
    id: 19,
    question: "الصيغة C8H10 بتعني ياتو مركب؟",
    options: ["غاز النفتالين", "إيثر البنزين", "الهبتانول", "ايثيل بنزين"],
    correctAnswer: 3
  },
  {
    id: 20,
    question: "كل من الآتي من استعمالات الإيثر عدا:",
    options: ["المذيبات", "المخدرات", "مستحضرات التجميل", "لا شيء مما سبق"],
    correctAnswer: 2
  }
];
